In [2]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName("PySpark_codingChallenge").getOrCreate()

In [3]:
#creating two dataframes for joins to be performed
emp = [(1,"John",-1,"2018","10","M",3000),(2, "Emerald",1 , "2010", "20","F", 4000),(3,"Dustin",1,"2010","10","M",1000),
       (4, "Nancy",2 ,"2005","10","F",2000),(5,"Brown",2,"2010","40","",-1),(6, "Brown", 2, "2010","50","",-1)]
empColumns = ["emp_id","name","superior_emp_id","year_joined", "emp_dept_id","gender","salary"]

empDF = spark.createDataFrame(data=emp, schema = empColumns)
empDF.printSchema()
empDF.show()

dept = [("Finance",10),("Marketing",20),("Sales",30),("IT",40)]
deptColumns = ["dept_name","dept_id"]
deptDF = spark.createDataFrame(data=dept, schema = deptColumns)
deptDF.printSchema()
deptDF.show()

root
 |-- emp_id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- superior_emp_id: long (nullable = true)
 |-- year_joined: string (nullable = true)
 |-- emp_dept_id: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

+------+-------+---------------+-----------+-----------+------+------+
|emp_id|   name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+-------+---------------+-----------+-----------+------+------+
|     1|   John|             -1|       2018|         10|     M|  3000|
|     2|Emerald|              1|       2010|         20|     F|  4000|
|     3| Dustin|              1|       2010|         10|     M|  1000|
|     4|  Nancy|              2|       2005|         10|     F|  2000|
|     5|  Brown|              2|       2010|         40|      |    -1|
|     6|  Brown|              2|       2010|         50|      |    -1|
+------+-------+---------------+-----------+-----------+------+------+

root
 |-- dept_name: string (nullable = true)
 |-- dept_id: long (nullable = true)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|  Finance|     10|
|Marketing|     20|
|    Sales|     30|
|       IT|     40|
+---------+-------+

In [4]:
#inner join
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"inner").show()

+------+-------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|   name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+-------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   John|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3| Dustin|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|  Nancy|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|Emerald|              1|       2010|         20|     F|  4000|Marketing|     20|
|     5|  Brown|              2|       2010|         40|      |    -1|       IT|     40|
+------+-------+---------------+-----------+-----------+------+------+---------+-------+

In [5]:
#outer join
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"outer").show()

+------+-------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|   name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+-------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   John|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3| Dustin|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|  Nancy|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|Emerald|              1|       2010|         20|     F|  4000|Marketing|     20|
|  NULL|   NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|  Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|  Brown|              2|       2010|         50|      |    -1|     NULL|   NULL|
+------+-------+---------------+-----------+-----------+------+------+---------+-------+

In [6]:
#left join
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"left").show()

+------+-------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|   name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+-------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   John|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3| Dustin|              1|       2010|         10|     M|  1000|  Finance|     10|
|     2|Emerald|              1|       2010|         20|     F|  4000|Marketing|     20|
|     4|  Nancy|              2|       2005|         10|     F|  2000|  Finance|     10|
|     6|  Brown|              2|       2010|         50|      |    -1|     NULL|   NULL|
|     5|  Brown|              2|       2010|         40|      |    -1|       IT|     40|
+------+-------+---------------+-----------+-----------+------+------+---------+-------+

In [7]:
#right join
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"right").show()

+------+-------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|   name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+-------+---------------+-----------+-----------+------+------+---------+-------+
|     4|  Nancy|              2|       2005|         10|     F|  2000|  Finance|     10|
|     3| Dustin|              1|       2010|         10|     M|  1000|  Finance|     10|
|     1|   John|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     2|Emerald|              1|       2010|         20|     F|  4000|Marketing|     20|
|  NULL|   NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|  Brown|              2|       2010|         40|      |    -1|       IT|     40|
+------+-------+---------------+-----------+-----------+------+------+---------+-------+

In [8]:
#left semi join
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"leftsemi").show()

+------+-------+---------------+-----------+-----------+------+------+
|emp_id|   name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+-------+---------------+-----------+-----------+------+------+
|     1|   John|             -1|       2018|         10|     M|  3000|
|     3| Dustin|              1|       2010|         10|     M|  1000|
|     4|  Nancy|              2|       2005|         10|     F|  2000|
|     2|Emerald|              1|       2010|         20|     F|  4000|
|     5|  Brown|              2|       2010|         40|      |    -1|
+------+-------+---------------+-----------+-----------+------+------+

In [9]:
#left anti join
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"leftanti").show()

+------+-----+---------------+-----------+-----------+------+------+
|emp_id| name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+-----+---------------+-----------+-----------+------+------+
|     6|Brown|              2|       2010|         50|      |    -1|
+------+-----+---------------+-----------+-----------+------+------+

In [10]:
#Applying function on pandas

In [11]:
import pandas as pd
data = [["John", "", "Johnson", 30, "M", 60000],
        ["Matthew", "River", "", 50, "M", 70000],
        ["Richard", "", "Walker", 42, "", 400000],
        ["Sophia", "Grace", "Smith", 38, "F", 500000],
        ["David", "Michael", "Taylor", 45, None, 0]]

columns=['First Name','Middle Name','Last Name','Age','Gender','Salary'] 
# Create the pandas DataFrame
pandasDF=pd.DataFrame(data=data, columns=columns)
# print dataframe.
print(pandasDF)

  First Name Middle Name Last Name  Age Gender  Salary
0       John               Johnson   30      M   60000
1    Matthew       River             50      M   70000
2    Richard                Walker   42         400000
3     Sophia       Grace     Smith   38      F  500000
4      David     Michael    Taylor   45   None       0

In [12]:
print(pandasDF.count())

First Name     5
Middle Name    5
Last Name      5
Age            5
Gender         4
Salary         5
dtype: int64

In [13]:
print(pandasDF.head(2))

  First Name Middle Name Last Name  Age Gender  Salary
0       John               Johnson   30      M   60000
1    Matthew       River             50      M   70000

In [14]:
import pandas as pd

# Sample data
data = {'A': [1, 2, 3, 4, 5],
        'B': [10, 20, 30, 40, 50]}

# Create DataFrame
df = pd.DataFrame(data)

# Define a function to add the 10 in the values
def add_values(x):
    return x+10

# Apply the function to column 'B'
df['B'] = df['B'].apply(add_values)

# Display the modified DataFrame
print(df)

   A   B
0  1  20
1  2  30
2  3  40
3  4  50
4  5  60